/*
 * Copyright (c) 2005-2011 Imperas Software Ltd., www.imperas.com
 *
 * YOUR ACCESS TO THE INFORMATION IN THIS MODEL IS CONDITIONAL
 * UPON YOUR ACCEPTANCE THAT YOU WILL NOT USE OR PERMIT OTHERS
 * TO USE THE INFORMATION FOR THE PURPOSES OF DETERMINING WHETHER
 * IMPLEMENTATIONS OF THE ARM ARCHITECTURE INFRINGE ANY THIRD
 * PARTY PATENTS.
 *
 * THE LICENSE BELOW EXTENDS ONLY TO USE OF THE SOFTWARE FOR
 * MODELING PURPOSES AND SHALL NOT BE CONSTRUED AS GRANTING
 * A LICENSE TO CREATE A HARDWARE IMPLEMENTATION OF THE
 * FUNCTIONALITY OF THE SOFTWARE LICENSED HEREUNDER.
 * YOU MAY USE THE SOFTWARE SUBJECT TO THE LICENSE TERMS BELOW
 * PROVIDED THAT YOU ENSURE THAT THIS NOTICE IS REPLICATED UNMODIFIED
 * AND IN ITS ENTIRETY IN ALL DISTRIBUTIONS OF THE SOFTWARE,
 * MODIFIED OR UNMODIFIED, IN SOURCE CODE OR IN BINARY FORM.
 *
 * Licensed under an Imperas Modfied Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.ovpworld.org/licenses/OVP_MODIFIED_1.0_APACHE_OPEN_SOURCE_LICENSE_2.0.pdf
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied.
 *
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

#ifndef ARM_CP_REGISTERS_H

    CP_ID(TLBIMVAA),
    CP_ID(DTLBLR),
    CP_ID(ITLBLR),
    CP_ID(TLBLDVA),
    CP_ID(TLBLDPA),
    CP_ID(TLBLDATTR),

    // MPU operations, pre ARMv6
    CP_ID(DAPR),
    CP_ID(IAPR),
    CP_ID(DEAPR),
    CP_ID(IEAPR),
    CP_ID(DMRR0),
    CP_ID(DMRR1),
    CP_ID(DMRR2),
    CP_ID(DMRR3),
    CP_ID(DMRR4),
    CP_ID(DMRR5),
    CP_ID(DMRR6),
    CP_ID(DMRR7),
    CP_ID(IMRR0),
    CP_ID(IMRR1),
    CP_ID(IMRR2),
    CP_ID(IMRR3),
    CP_ID(IMRR4),
    CP_ID(IMRR5),
    CP_ID(IMRR6),
    CP_ID(IMRR7),

    // MPU operations
    CP_ID(DRBAR),
    CP_ID(IRBAR),
    CP_ID(DRSR),
    CP_ID(IRSR),
    CP_ID(DRACR),
    CP_ID(IRACR),

    // common cache operations (MCR/MRC)
    CP_ID(CP15WFI),
    CP_ID(CP15ISB),
    CP_ID(CP15DSB),
    CP_ID(CP15DMB),
    CP_ID(PrefetchICacheLine),

    // ARMv7 cache operations (MCR/MRC)
    CP_ID(CCSIDR),
    CP_ID(ICIALLUIS),
    CP_ID(BPIALLIS),
    CP_ID(ICIALLU),
    CP_ID(ICIMVAU),
    CP_ID(BPIALL),
    CP_ID(BPIMVA),
    CP_ID(DCIMVAC),
    CP_ID(DCISW),
    CP_ID(DCCMVAC),
    CP_ID(DCCSW),
    CP_ID(DCCMVAU),
    CP_ID(DCCIMVAC),
    CP_ID(DCCISW),

    // ARMv6 cache operations (MCR/MRC)
    CP_ID(InvalidateICache),
    CP_ID(InvalidateICacheLineMVA),
    CP_ID(InvalidateICacheLineSW),
    CP_ID(FlushBranchTargetCache),
    CP_ID(FlushBranchTargetEntry),
    CP_ID(InvalidateDCache),
    CP_ID(InvalidateDCacheLineMVA),
    CP_ID(InvalidateDCacheLineSW),
    CP_ID(InvalidateUnified),
    CP_ID(CleanDCache),
    CP_ID(CleanDCacheLineMVA),
    CP_ID(CleanDCacheLineSW),
    CP_ID(DirtyStatus),
    CP_ID(CleanUnified),
    CP_ID(BlockTransferStatus),
    CP_ID(StopPrefetchRange),
    CP_ID(CleanInvalDCache),
    CP_ID(CleanInvalDCacheLineMVA),
    CP_ID(CleanInvalDCacheLineSW),
    CP_ID(CleanInvalUnified),

    // ARMv5 cache operations (MCR/MRC)
    CP_ID(TestCleanDCache),
    CP_ID(TestCleanInvalDCache),

    // ARMv6 cache operations (MCRR/MRRC)
    CP_ID(InvalICacheRange),
    CP_ID(InvalDCacheRange),
    CP_ID(CleanDCacheRange),
    CP_ID(PrefetchICacheRange),
    CP_ID(PrefetchDCacheRange),
    CP_ID(CleanInvalDCacheRange),
    CP_ID(Ignored),

    // DMA operations
    CP_ID(DMAStop),
    CP_ID(DMAStart),
    CP_ID(DMAClear),
    CP_ID(DMAControl),
    CP_ID(DMAInternalStart),
    CP_ID(DMAExternalStart),
    CP_ID(DMAInternalEnd),
    CP_ID(DMAStatus),
    CP_ID(DMAContextID),

    // CortexA9MP CRn15 operations
    CP_ID(NEONB),

    // keep last (used to define size of the enumeration)
    CP_ID(Size),

} armCPRegId;

// use this to declare a register structure below
#define CP_REG_STRUCT_DECL(_N) armCPReg_##_N


// -----------------------------------------------------------------------------
// COPROCESSOR 14 REGISTERS
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
// Coprocessor 14 register 6/0: TEECR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 XED :  1;
    Uns32 _u1 : 31;
} CP_REG_STRUCT_DECL(TEECR);

#define CP_WRITE_MASK_TEECR 0x00000001

// -----------------------------------------------------------------------------
// Coprocessor 14 register 6/1: TEEHBR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 SBZ         :  2;
    Uns32 HandlerBase : 30;
} CP_REG_STRUCT_DECL(TEEHBR);

#define CP_WRITE_MASK_TEEHBR 0xfffffffc

// -----------------------------------------------------------------------------
// Coprocessor 14 register 7/0: JIDR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32          _u1            : 12;
    Uns32          Subarchitecture:  8;
    armImplementor Implementor    :  8;
    Uns32          Architecture   :  4;
} CP_REG_STRUCT_DECL(JIDR);

#define CP_WRITE_MASK_JIDR 0x00000000

// -----------------------------------------------------------------------------
// Coprocessor 14 register 7/1: JOSCR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 CD  :  1;
    Uns32 CV  :  1;
    Uns32 _u1 : 30;
} CP_REG_STRUCT_DECL(JOSCR);

#define CP_WRITE_MASK_JOSCR 0x00000000

// -----------------------------------------------------------------------------
// Coprocessor 14 register 7/2: JMCR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 JE  :  1;
    Uns32 _u1 : 31;
} CP_REG_STRUCT_DECL(JMCR);

#define CP_WRITE_MASK_JMCR 0x00000000


// -----------------------------------------------------------------------------
// COPROCESSOR 15 REGISTERS
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=0 opc2=0: MIDR
// -----------------------------------------------------------------------------

typedef union {
    struct {
        Uns32          Revision    :  4;
        Uns32          PartNum     : 12;
        Uns32          Variant     :  7;
        Uns32          A           :  1;
        armImplementor Implementor :  8;
    } arm7;
    struct {
        Uns32          Revision    :  4;
        Uns32          PartNum     : 12;
        Uns32          Architecture:  4;
        Uns32          Variant     :  4;
        armImplementor Implementor :  8;
    } postArm7;
} CP_REG_STRUCT_DECL(MIDR);

#define CP_WRITE_MASK_MIDR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=0 opc2=1: CTR
// -----------------------------------------------------------------------------

#define CT_PRE_V7  0
#define CT_POST_V7 4

typedef union {
    struct {
        Uns32 Isize_len   :  2;
        Uns32 Isize_M     :  1;
        Uns32 Isize_assoc :  3;
        Uns32 Isize_size  :  4;
        Uns32 Isize_u1    :  1;
        Uns32 Isize_P     :  1;
        Uns32 Dsize_len   :  2;
        Uns32 Dsize_M     :  1;
        Uns32 Dsize_assoc :  3;
        Uns32 Dsize_size  :  4;
        Uns32 Dsize_u1    :  1;
        Uns32 Dsize_P     :  1;
        Uns32 S           :  1;
        Uns32 ctype       :  4;
        Uns32 format      :  3;
    } preV7;
    struct {
        Uns32 IMinLine    :  4;
        Uns32 _u1         : 10;
        Uns32 L1Ipolicy   :  2;
        Uns32 DMinLine    :  4;
        Uns32 ERG         :  4;
        Uns32 CWG         :  4;
        Uns32 _u3         :  1;
        Uns32 format      :  3;
    } postV7;
} CP_REG_STRUCT_DECL(CTR);

#define CP_WRITE_MASK_CTR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=0 opc2=2: TCMTR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 ITCM        :  3;
    Uns32 _u1         : 13;
    Uns32 DTCM        :  3;
    Uns32 _u2         : 13;
} CP_REG_STRUCT_DECL(TCMTR);

#define CP_WRITE_MASK_TCMTR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=0 opc2=3: TLBTR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 nU     : 1;
    Uns32 _u1    : 7;
    Uns32 DLsize : 8;
    Uns32 ILsize : 8;
    Uns32 _u2    : 8;
} CP_REG_STRUCT_DECL(TLBTR);

#define CP_WRITE_MASK_TLBTR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=0 opc2=4: MPUIR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 nU      : 1;
    Uns32 _u1     : 7;
    Uns32 DRegion : 8;
    Uns32 IRegion : 8;
    Uns32 _u2     : 8;
} CP_REG_STRUCT_DECL(MPUIR);

#define CP_WRITE_MASK_MPUIR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=0 opc2=5: MPIDR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 AffinityLevel0 : 8;
    Uns32 AffinityLevel1 : 8;
    Uns32 AffinityLevel2 : 8;
    Uns32 MT             : 1;
    Uns32 _u1            : 5;
    Uns32 U              : 1;
    Uns32 Implemented    : 1;
} CP_REG_STRUCT_DECL(MPIDR);

#define CP_WRITE_MASK_MPIDR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=0: ID_PFR0
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 State0 :  4;
    Uns32 State1 :  4;
    Uns32 State2 :  4;
    Uns32 State3 :  4;
    Uns32 _u1    : 16;
} CP_REG_STRUCT_DECL(ID_PFR0);

#define CP_WRITE_MASK_ID_PFR0 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=1: ID_PFR1
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 ProgrammersModel      :  4;
    Uns32 SecurityExtension     :  4;
    Uns32 MicroProgrammersModel :  4;
    Uns32 _u1                   : 20;
} CP_REG_STRUCT_DECL(ID_PFR1);

#define CP_WRITE_MASK_ID_PFR1 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=2: ID_DFR0
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 CoreDebug     : 4;
    Uns32 SecureDebug   : 4;
    Uns32 EmbeddedDebug : 4;
    Uns32 TraceDebugCP  : 4;
    Uns32 TraceDebugMM  : 4;
    Uns32 MicroDebug    : 4;
    Uns32 _u1           : 8;
} CP_REG_STRUCT_DECL(ID_DFR0);

#define CP_WRITE_MASK_ID_DFR0 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=3: ID_AFR0
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 _u1 : 32;
} CP_REG_STRUCT_DECL(ID_AFR0);

#define CP_WRITE_MASK_ID_AFR0 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=4: ID_MMFR0
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 VMSA               : 4;
    Uns32 PMSA               : 4;
    Uns32 OuterShareability  : 4;
    Uns32 ShareabilityLevels : 4;
    Uns32 TCMSupport         : 4;
    Uns32 AuxillaryRegisters : 4;
    Uns32 FCSESupport        : 4;
    Uns32 InnerShareability  : 4;
} CP_REG_STRUCT_DECL(ID_MMFR0);

#define CP_WRITE_MASK_ID_MMFR0 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=5: ID_MMFR1
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 L1VAHarvard : 4;
    Uns32 L1VAUnified : 4;
    Uns32 L1SWHarvard : 4;
    Uns32 L1SWUnified : 4;
    Uns32 L1Harvard   : 4;
    Uns32 L1Unified   : 4;
    Uns32 L1TestClean : 4;
    Uns32 BTB         : 4;
} CP_REG_STRUCT_DECL(ID_MMFR1);

#define CP_WRITE_MASK_ID_MMFR1 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=6: ID_MMFR2
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 L1FgndPrefetchHarvard : 4;
    Uns32 L1BgndPrefetchHarvard : 4;
    Uns32 L1MaintRangeHarvard   : 4;
    Uns32 TLBMaintHarvard       : 4;
    Uns32 TLBMaintUnified       : 4;
    Uns32 MemoryBarrierCP15     : 4;
    Uns32 WaitForInterruptStall : 4;
    Uns32 HWAccessFlag          : 4;
} CP_REG_STRUCT_DECL(ID_MMFR2);

#define CP_WRITE_MASK_ID_MMFR2 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=1 opc2=7: ID_MMFR3
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 HierMaintSW  : 4;
    Uns32 HierMaintMVA : 4;
    Uns32 BPMaint      : 4;
    Uns32 MaintBCast   : 4;
    Uns32 _u1          : 4;
    Uns32 CoherentWalk : 4;
    Uns32 _u2          : 4;
    Uns32 Supersection : 4;
} CP_REG_STRUCT_DECL(ID_MMFR3);

#define CP_WRITE_MASK_ID_MMFR3 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=0: ID_ISAR0
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 Swap_instrs      : 4;
    Uns32 BitCount_instrs  : 4;
    Uns32 BitField_instrs  : 4;
    Uns32 CmpBranch_instrs : 4;
    Uns32 Coproc_instrs    : 4;
    Uns32 Debug_instrs     : 4;
    Uns32 Divide_instrs    : 4;
    Uns32 _u1              : 4;
} CP_REG_STRUCT_DECL(ID_ISAR0);

#define CP_WRITE_MASK_ID_ISAR0 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=1: ID_ISAR1
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 Endian_instrs    : 4;
    Uns32 Except_instrs    : 4;
    Uns32 Except_AR_instrs : 4;
    Uns32 Extend_instrs    : 4;
    Uns32 IfThen_instrs    : 4;
    Uns32 Immediate_instrs : 4;
    Uns32 Interwork_instrs : 4;
    Uns32 Jazelle_instrs   : 4;
    Uns32 Murac_instrs     : 4;
} CP_REG_STRUCT_DECL(ID_ISAR1);

#define CP_WRITE_MASK_ID_ISAR1 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=2: ID_ISAR2
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 LoadStore_instrs      : 4;
    Uns32 MemHint_instrs        : 4;
    Uns32 MultiAccessInt_instrs : 4;
    Uns32 Mult_instrs           : 4;
    Uns32 MultS_instrs          : 4;
    Uns32 MultU_instrs          : 4;
    Uns32 PSR_AR_instrs         : 4;
    Uns32 Reversal_instrs       : 4;
} CP_REG_STRUCT_DECL(ID_ISAR2);

#define CP_WRITE_MASK_ID_ISAR2 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=3: ID_ISAR3
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 Saturate_instrs     : 4;
    Uns32 SIMD_instrs         : 4;
    Uns32 SVC_instrs          : 4;
    Uns32 SynchPrim_instrs    : 4;
    Uns32 TabBranch_instrs    : 4;
    Uns32 ThumbCopy_instrs    : 4;
    Uns32 TrueNOP_instrs      : 4;
    Uns32 T2ExeEnvExtn_instrs : 4;
} CP_REG_STRUCT_DECL(ID_ISAR3);

#define CP_WRITE_MASK_ID_ISAR3 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=4: ID_ISAR4
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 Unpriv_instrs         : 4;
    Uns32 WithShifts_instrs     : 4;
    Uns32 Writeback_instrs      : 4;
    Uns32 SMI_instrs            : 4;
    Uns32 Barrier_instrs        : 4;
    Uns32 SynchPrim_instrs_frac : 4;
    Uns32 PSR_M_instrs          : 4;
    Uns32 SWP_frac              : 4;
} CP_REG_STRUCT_DECL(ID_ISAR4);

#define CP_WRITE_MASK_ID_ISAR4 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=5: ID_ISAR5
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 _u1 : 32;
} CP_REG_STRUCT_DECL(ID_ISAR5);

#define CP_WRITE_MASK_ID_ISAR5 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=0 CRm=2 opc2=5: ID_RESERVED
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 _u1 : 32;
} CP_REG_STRUCT_DECL(ID_RESERVED);

#define CP_WRITE_MASK_ID_RESERVED 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=1 CRm=0 opc2=0: CCSIDR
// -----------------------------------------------------------------------------

#define ARM_NUM_CCSIDR 7

typedef struct {
    Uns32 LineSize      :  3;
    Uns32 Associativity : 10;
    Uns32 NumSets       : 15;
    Uns32 WA            :  1;
    Uns32 RA            :  1;
    Uns32 WB            :  1;
    Uns32 WT            :  1;
} CP_REG_STRUCT_DECL(CCSIDR);

#define CP_WRITE_MASK_CCSIDR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=1 CRm=0 opc2=1: CLIDR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 Ctype1 : 3;
    Uns32 Ctype2 : 3;
    Uns32 Ctype3 : 3;
    Uns32 Ctype4 : 3;
    Uns32 Ctype5 : 3;
    Uns32 Ctype6 : 3;
    Uns32 Ctype7 : 3;
    Uns32 LoUIS  : 3;
    Uns32 LoC    : 3;
    Uns32 LoUU   : 3;
    Uns32 _u1    : 2;
} CP_REG_STRUCT_DECL(CLIDR);

#define CP_WRITE_MASK_CLIDR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=1 CRm=0 opc2=7: AIDR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 value;
} CP_REG_STRUCT_DECL(AIDR);

#define CP_WRITE_MASK_AIDR 0x00000000

// -----------------------------------------------------------------------------
// CRn=0 opc1=2 CRm=0 opc2=0: CSSELR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 InD   :  1;
    Uns32 Level :  3;
    Uns32 _u1   : 28;
} CP_REG_STRUCT_DECL(CSSELR);

#define CP_WRITE_MASK_CSSELR 0x0000000f

// -----------------------------------------------------------------------------
// CRn=1 opc1=0 CRm=0 opc2=0: SCTLR
// -----------------------------------------------------------------------------

typedef struct {
    Uns32 M   : 1;      //  0
    Uns32 A   : 1;      //  1
    Uns32 C   : 1;      //  2
    Uns32 W   : 1;      //  3
    Uns32 P   : 1;      //  4
    Uns32 D   : 1;      //  5
    Uns32 L   : 1;      //  6
    Uns32 B   : 1;      //  7
    Uns32 S   : 1;      //  8
    Uns32 R   : 1;      //  9
    Uns32 SW  : 1;      // 10
    Uns32 Z   : 1;      // 11
    Uns32 I   : 1;      // 12
    Uns32 V   : 1;      // 13
    Uns32 RR  : 1;      // 14
    Uns32 L4  : 1;      // 15
    Uns32 DT  : 1;      // 16
    Uns32 HA  : 1;      // 17
    Uns32 IT  : 1;      // 18
    Uns32 DZ  : 1;      // 19
    Uns32 _u1 : 1;      // 20
    Uns32 FI  : 1;      // 21
    Uns32 U   : 1;      // 22
    Uns32 XP  : 1;      // 23
    Uns32 VE  : 1;      // 24
    Uns32 EE  : 1;      // 25
    Uns32 L2  : 1;      // 26
    Uns32 NMI : 1;      // 27
    Uns32 TRE : 1;      // 28
    Uns32 AFE : 1;      // 29
    Uns32 TE  : 1;      // 30
    Uns32 IE  : 1;      // 31
} CP_REG_STRUCT_DECL(SCTLR);

// true mask for SCTLR register comes from configuration information
#define CP_WRITE_MASK_SCTLR 0x00000000

// -----------------------------------------------------------------------------
// CRn=1 opc1=0 CRm=0 opc2=1: ACTLR
// -----------------------------------------------------------------------------

typedef union {
    struct {
        Uns32 RS  :  1;
        Uns32 DB  :  1;
        Uns32 SB  :  1;
        Uns32 TR  :  1;
        Uns32 RA  :  1;
        Uns32 RV  :  1;
        Uns32 CZ  :  1;
        Uns32 _u1 : 25;
    } preV7;
    struct {
        Uns32 FW        :  1;
        Uns32 L2PF      :  1;
        Uns32 L1PF      :  1;
        Uns32 WFLZ      :  1;
        Uns32 _u1       :  2;
        Uns32 SMP       :  1;
        Uns32 EXCL      :  1;
        Uns32 Alloc1Way :  1;
        Uns32 Parity    :  1;
        Uns32 _u2       : 22;
    } postV7;
} CP_REG_STRUCT_DECL(ACTLR);

#define CP_WRITE_MASK_ACTLR 0xffffffff

